W9D2/art_share_part_2/app/controllers/artworks_controller.rb

  def index
    if params[:user_id]
      artworks = Artwork.where(artist_id: params[:user_id])
      render json: artworks
    else
      render json: Artwork.all
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 14]]
SELECT "artworks".* FROM "artworks"