W9D2/art_share_part_2/app/controllers/comments_controller.rb

  def index
    if params[:user_id]
      comments = Comment.where(user_id: params[:user_id])
      render json: comments
    elsif params[:artwork_id]
      render json: Comment.where(artwork_id: params[:artwork_id])
    else
      render json: Comment.all
---
SELECT "comments".* FROM "comments"