W9D2/art_share_part_2/app/controllers/users_controller.rb

  def index
    if params[:query]
      render json: User.where('username Like ?' , "%#{params[:query]}%")
    else
      render json: User.all
---
SELECT "users".* FROM "users"